app/Controllers/ArticleController.php

    public function delete($id) {
        $artikel = new Article();
        $artikel->delete($id);
---
DELETE FROM `artikel`
WHERE `id` IN ('6')