app/Controllers/UserController.php

    public function index() {
        $title = 'Daftar User';
        $model = new User();
        $users = $model->findAll();
---
SELECT *
FROM `users`

    public function login() {
        helper(['form']);
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        if (!$email) {
            return view('login', compact('email'));
        }
        $session = session();
        $model = new User();
        $login = $model->where('useremail', $email)->first();
---
SELECT *
FROM `users`
WHERE `useremail` = 'admin@example.com'
 LIMIT 1